# ### Списки:

# 1. **Робота із списками:**
#    Завдання: Створіть список чисел. Додайте до списку числа 10 і 20, видаліть число 10 і виведіть отриманий список.
first_list = [2,3,6,8]
first_list.extend ([10, 20])
print (first_list)
first_list.remove(10)
print (first_list)

# 2. **Знаходження суми:**
#    Завдання: Створіть список чисел. Знайдіть та виведіть суму всіх чисел у списку.
second_list = [1,3,5,7,9]
sum = 0
for num in second_list:
    sum += num
print (sum)
# 3. **Подвійні значення:**
#    Завдання: Створіть список чисел. Подвойте кожне число у списку та виведіть результат.
third_list = [2,4,6,8,10]
for num in third_list:
    num *= 2
    print (num)

# ### Кортежі:

# 1. **Робота із кортежами:**
#    Завдання: Створіть кортеж з трьох різних предметів, таких як ("яблуко", "банан", "апельсин"). Виведіть кожен елемент кортежу окремо.
first_cor = ("яблуко", "банан", "апельсин")
print(first_cor[0])
print(first_cor[1])
print(first_cor[2])
# 2. **Об'єднання кортежів:**
#    Завдання: Створіть два кортежі з числами і об'єднайте їх у новий кортеж. Виведіть отриманий кортеж.
second_cor = (1,3,5,7)
third_cor = (2,4,6,8)
last_cor = second_cor + third_cor
print (last_cor)
# ### Словники:

# 1. **Робота із словниками:**
#    Завдання: Створіть словник, що містить інформацію про вашого улюбленого спортсмена (ім'я, вік, спорт, команда тощо). Виведіть цю інформацію на екран.

# 2. **Оновлення словника:**
#    Завдання: Створіть словник, що містить ваші улюблені книги (назва книги та рік видання). Додайте до словника нову улюблену книгу та виведіть оновлений словник.

# 3. **Пошук значення:**
#    Завдання: Створіть словник, що містить інформацію про країни та їх столиці. Запитайте користувача про назву країни і виведіть столицю цієї країни (якщо така країна є у словнику).

# Завершіть кожне завдання, використовуючи вбудовані методи для списків, кортежів та словників. Бажаю успіхів у виконанні цих завдань